app/controllers/trails_controller.rb

  def index
    @trails = Trail.all
---
SELECT "trails".* FROM "trails"