app/controllers/trails_controller.rb

def show
  @trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = ? LIMIT 1  [["id", "1"]]

	def create
      @trail = Trail.new(params.require(:trail).permit([:name, :street, :city, :postal_code]))
      if @trail.save
---
INSERT INTO "trails" ("city", "created_at", "gmaps", "latitude", "longitude", "name", "postal_code", "street", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)